#include "Animal.h"

int main()
{
	A a;
	a.Sound();
}

// 
// 
// 일반함수는 컴파일 단계에서
// => 스택에 저장
//  함수의 주소를 스택에 - LINK를 통해
// 
// 
// inline 이 커지면 
// 오버헤드 
// 

// inline 
// 템플릿 특징

// 정확한 타입을 명시를 안하면
// 호출 되기전까지는 어셈블리어로 변환이 안된다.
// 
// 템플릿이 컴파일단계에서 인스턴스화 cpp.에 정의를 하면
// 인스턴스화 => 
// 
// class를  생성하면 인스턴스화

// cpu 제조사가 달라서 
// intel , AMD 
// Add => 1010 => 1111
// Add => 1000 => 1111


//c++ -=> c컴파일러가 
// 어셈블리어 


// 이진탐색 ?? 이진 트리? 
// 레드블랙 , 포화 , 완전 , MST 
// 
// 사용용도 STL 내부 
// 레드블랙 => 왼쪽 무조건 오른 큰거
// map<> //  
// AVL => 레드블랙트리가 자주 쓰이는 이유 

// 기억이안남